1_ttyname.c
    tty(终端设备的统称)
    pty（虚拟终端)
    pts(pseudo-terminal slave)是pty的实现方法
     
    ttyname(int): 不同的设备终端对应的设备文件名
        
    tty[1-6]就是你用ctr+alt+f[1-6]所看到的那个终端; 即虚拟控制台。
    pts/*为伪(虚拟)终端, 其中pts/0,1,2在桌面Linux中是标准输入，标准输出，标准出错
        SSH Telnet 是网络终端
        Alt+F7是图形终端
    
===================================================================================   
2_kill_multprocess.c
    进程组的概念        
        kill -9 -xxxx
        
===================================================================================   
3_setpgid.c
    设置进程默认所属的进程组

===================================================================================
4_session.c
  利用setsid创建会话，并以自己的ID设置进程组ID，同时也是新会话的ID  

===================================================================================
5_mydaemond.c
    守护进程的创建与初始化
    
    
===================================================================================

    
    




   
